
&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ББ_ПланыПроизводства.Ссылка КАК ДокументПланирования,
	               |	ББ_ПланыПроизводства.Заказ КАК Заказ,
	               |	ББ_ПланыПроизводства.УчастокПроизводства КАК Участок,
	               |	ББ_ПланыПроизводства.ДатаСтарта КАК ДатаСтарта,
	               |	ББ_ПланыПроизводства.ДатаЗавершения КАК ДатаЗавершения,
	               |	ББ_ПланыПроизводства.Комментарий КАК Комментарий,
	               |	ББ_ПланыПроизводства.Завершен КАК Завершен,
	               |	ЗаказПокупателяЗапасы.Номенклатура.ББ_Модель КАК Модель,
	               |	ЗаказПокупателяЗапасы.Ссылка.ББ_НестандартныйЗаказ КАК НЗ,
	               |	ЗаказПокупателяЗапасы.Ссылка.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ЗаказПокупателяЗапасы.Ссылка.ББ_комплект КАК Комплектация,
	               |	ЗаказПокупателяЗапасы.Ссылка.ББ_Материал КАК Материал
	               |ИЗ
	               |	Документ.ББ_ПланыПроизводства КАК ББ_ПланыПроизводства
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	               |		ПО ББ_ПланыПроизводства.Заказ = ЗаказПокупателяЗапасы.Ссылка
	               |ГДЕ
	               |	ЗаказПокупателяЗапасы.Номенклатура В ИЕРАРХИИ(&НоменклатурнаяГруппа)
	               |ИТОГИ
	               |	МИНИМУМ(ДатаСтарта),
	               |	МИНИМУМ(Завершен),
	               |	МАКСИМУМ(Модель)
	               |ПО
	               |	Заказ";
	
	Запрос.УстановитьПараметр("УчастокПроизводства", УчастокПроизводства);	
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	
	//Таблица = Запрос.Выполнить().Выгрузить();
	
	Таблица = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВРеквизитФормы(Таблица, "ПланированиеТаблица");

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
